# language: uk

@Subscription

Функціонал: Оплата підписки

Передумова:
    Припустимо клієнт зареєстрований 
    І намагається оформити підписку на активний курс

Сценарій: Оформлення успішне
    Коли клієнт підтверджує підписку
    Тоді створюється замовлення зі статусом "Очікує оплати"
    І платіжному шлюзу надсилається запит протягом 2 секунд
    Коли шлюз повідомляє про успішну оплату
    Тоді статус підписки "Активна"
    І клієнту надсилається підтвердження на email

Сценарій: Відмова банку
    Коли шлюз відхиляє оплату
    Тоді статус підписки "Очікує оплати"
    І клієнту надсилається на email лист про відхилення оплати підписки

Сценарій: Промокод правильний
     Припустимо є певна сума до оплати підписки
     Коли клієнт вводить правильний промокод 
     Тоді сума до оплати зменшується відповідно до змісту промокоду
    
Сценарій: Промокод не правильний
    Припустимо є певна сума до оплати підписки
    Коли клієнт вводить не правильний промокод 
    Тоді сума до оплати не змінюється
    І клієнт отримує поідомлення про не коректно введені дані



Приклади:
      | сума | код      | відсоток | результат           |
      | 1000 | HUB123   | 0.15     | 850                 |
      | 1000 | SHOOL26  | 0.1      | 1000 (код відхилено)|
      | 1000 | MATH44   | 0.05     | 950                 |